{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "425047e5",
   "metadata": {},
   "outputs": [],
   "source": [
    "Условие:  \n",
    "\n",
    "Научитесь пользоваться стандартной структурой данных queue для целых чисел. Напишите программу, содержащую описание очереди и моделирующую работу очереди, реализовав все указанные здесь методы. \n",
    "\n",
    "Программа считывает последовательность команд и в зависимости от команды выполняет ту или иную операцию. После выполнения каждой команды программа должна вывести одну строчку.\n",
    "\n",
    "Возможные команды для программы:\n",
    "\n",
    "push n\n",
    "Добавить в очередь число n (значение n задается после команды). Программа должна вывести ok.\n",
    "\n",
    "pop\n",
    "Удалить из очереди первый элемент. Программа должна вывести его значение.\n",
    "\n",
    "front\n",
    "Программа должна вывести значение первого элемента, не удаляя его из очереди.\n",
    "\n",
    "size\n",
    "Программа должна вывести количество элементов в очереди.\n",
    "\n",
    "clear\n",
    "Программа должна очистить очередь и вывести ok.\n",
    "\n",
    "exit\n",
    "Программа должна вывести bye и завершить работу.\n",
    "\n",
    "Перед исполнением операций front и pop программа должна проверять, содержится ли в очереди хотя бы один элемент. Если во входных данных встречается операция front или pop, и при этом очередь пуста, то программа должна вместо числового значения вывести строку error.\n",
    "\n",
    "Формат ввода\n",
    "Вводятся команды управления очередью, по одной на строке\n",
    "\n",
    "Формат вывода\n",
    "Требуется вывести протокол работы очереди, по одному сообщению на строке"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fbf07821",
   "metadata": {},
   "outputs": [],
   "source": [
    "begin = [None, [], []]\n",
    "end = [None, [], []]\n",
    "prev = [None, [], []]\n",
    "\n",
    "marker1 = None\n",
    "\n",
    "k = 0\n",
    "\n",
    "while True:\n",
    "    a = input()\n",
    "    if a[:2] == 'pu':\n",
    "\n",
    "        end = [int(a.split()[-1]), prev, []]\n",
    "        prev[2] = end\n",
    "\n",
    "        if not marker1:\n",
    "            begin = end\n",
    "            marker1 = True\n",
    "\n",
    "        k += 1\n",
    "        prev = end\n",
    "\n",
    "        print('ok')\n",
    "\n",
    "    if a == 'pop':\n",
    "        if marker1:\n",
    "            print(begin[0])\n",
    "            k -= 1\n",
    "\n",
    "            if begin[2] != []:\n",
    "                begin = begin[2]\n",
    "\n",
    "            else:\n",
    "                begin = [None, [], []]\n",
    "                end = [None, [], []]\n",
    "                prev = [None, [], []]\n",
    "\n",
    "                marker1 = None\n",
    "\n",
    "\n",
    "\n",
    "        else:\n",
    "            print('error')\n",
    "\n",
    "    if a == 'front':\n",
    "        if marker1:\n",
    "            print(begin[0])\n",
    "        else:\n",
    "            print('error')\n",
    "\n",
    "    if a == 'size':\n",
    "        print(k)\n",
    "\n",
    "    if a == 'clear':\n",
    "        begin = [None, [], []]\n",
    "        end = [None, [], []]\n",
    "        prev = [None, [], []]\n",
    "\n",
    "        marker1 = None\n",
    "\n",
    "        k = 0\n",
    "\n",
    "        print('ok')\n",
    "\n",
    "\n",
    "    if a == 'show':\n",
    "        now = end\n",
    "        while now[1] != []: #вывод с конца\n",
    "            print(now[0])\n",
    "            now = now[1]\n",
    "\n",
    "        now = begin\n",
    "        while now[2] != []: #вывод сначала\n",
    "            print(now[0])\n",
    "            now = now[2]\n",
    "        else:\n",
    "            print(now[0])\n",
    "\n",
    "        #print(begin)\n",
    "\n",
    "    if a == 'exit':\n",
    "        print('bye')\n",
    "        break\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8496f948",
   "metadata": {},
   "outputs": [],
   "source": [
    "#решение с deque\n",
    "\n",
    "from collections import deque\n",
    "\n",
    "queue = collections.deque()\n",
    "\n",
    "while True:\n",
    "    a = input()\n",
    "    if a[:2] == 'pu':\n",
    "        queue.append(int(a.split()[-1]))\n",
    "        print('ok')\n",
    "\n",
    "    if a == 'pop':\n",
    "        try:\n",
    "            print(queue.popleft())\n",
    "        except IndexError:\n",
    "            print('error')\n",
    "\n",
    "    if a == 'front':\n",
    "        try:\n",
    "            print(queue[0])\n",
    "        except IndexError:\n",
    "            print('error')\n",
    "\n",
    "    if a == 'size':\n",
    "        print(len(queue))\n",
    "\n",
    "    if a == 'clear':\n",
    "        queue.clear()\n",
    "        print('ok')\n",
    "\n",
    "    if a == 'exit':\n",
    "        print('bye')\n",
    "        break"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
