{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "7e49e957",
   "metadata": {},
   "source": [
    "Условие:\n",
    "\n",
    "Научитесь пользоваться стандартной структурой данных stack для целых чисел. Программа считывает последовательность команд и в зависимости от команды выполняет ту или иную операцию. После выполнения каждой команды программа должна вывести одну строчку.\n",
    "\n",
    "Возможные команды для программы:\n",
    "\n",
    "push n\n",
    "Добавить в стек число n (значение n задается после команды). Программа должна вывести ok.\n",
    "\n",
    "pop\n",
    "Удалить из стека последний элемент. Программа должна вывести его значение.\n",
    "\n",
    "back\n",
    "Программа должна вывести значение последнего элемента, не удаляя его из стека.\n",
    "\n",
    "size\n",
    "Программа должна вывести количество элементов в стеке.\n",
    "\n",
    "clear\n",
    "Программа должна очистить стек и вывести ok.\n",
    "\n",
    "exit\n",
    "Программа должна вывести bye и завершить работу.\n",
    "\n",
    "Формат ввода\n",
    "Команды управления стеком вводятся в описанном ранее формате по одной на строке. Гарантируется, что набор входных команд удовлетворяет следующим требованиям: максимальное количество элементов в стеке в любой момент не превосходит 100, все команды pop и back корректны, то есть при их исполнении в стеке содержится хотя бы один элемент.\n",
    "\n",
    "Формат вывода\n",
    "Требуется вывести протокол работы со стеком, по одному сообщению в строке\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "088a296d",
   "metadata": {},
   "outputs": [],
   "source": [
    "stack = []\n",
    "while True:\n",
    "    a = input()\n",
    "    if a[:2] == 'pu':\n",
    "        stack.append(int(a.split()[-1]))\n",
    "        print('ok')\n",
    "\n",
    "    if a == 'pop':\n",
    "        print(stack.pop())\n",
    "\n",
    "    if a == 'back':\n",
    "        print(stack[-1])\n",
    "\n",
    "    if a == 'size':\n",
    "        print(len(stack))\n",
    "\n",
    "    if a == 'clear':\n",
    "        stack.clear()\n",
    "        print('ok')\n",
    "\n",
    "    if a == 'exit':\n",
    "        print('bye')\n",
    "        break\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8999ade5",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
