{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "10cf4bc1",
   "metadata": {},
   "source": [
    "Формат XML является распространенным способом обмена данными между различными программами. Недавно программист Иванов написал небольшую программу, которая сохраняет некоторую важную информацию в виде XML-строки.\n",
    "\n",
    "XML-строка состоит из открывающих и закрывающих тегов.\n",
    "\n",
    "Открывающий тег начинается с открывающей угловой скобки (<), за ней следует имя тега — непустая строка из строчных букв латинского алфавита, а затем закрывающая угловая скобка (>). Примеры открывающих тегов: <a>, <dog>.\n",
    "\n",
    "Закрывающий тег начинается с открывающей угловой скобки, за ней следует прямой слеш (/), затем имя тега — непустая строка из строчных букв латинского алфавита, а затем закрывающая угловая скобка. Примеры закрывающихся тегов: </a>, </dog>.\n",
    "\n",
    "XML-строка называется корректной, если она может быть получена по следующим правилам:\n",
    "\n",
    "• Пустая строка является корректной XML-строкой.\n",
    "\n",
    "• Если A и B — корректные XML-строки, то строка AB, получающаяся приписыванием строки B в конец строки A, также является корректной XML-строкой.\n",
    "\n",
    "• Если A — корректная XML-строка, то строка <X>A</X>, получающаяся приписыванием в начало A открывающегося тега, а в конец — закрывающегося с таким же именем, также является корректной XML-строкой. Здесь X — любая непустая строка из строчных букв латинского алфавита.\n",
    "\n",
    "Например, представленные ниже строки:\n",
    "\n",
    "<a></a>\n",
    "\n",
    "<a><ab></ab><c></c></a>\n",
    "\n",
    "<a></a><a></a><a></a>\n",
    "\n",
    "являются корректными XML-строками, а такие строки как:\n",
    "\n",
    "<a></b>\n",
    "\n",
    "<a><b>\n",
    "\n",
    "<a><b></a></b>\n",
    "\n",
    "не являются корректными XML-строками.\n",
    "\n",
    "Иванов отправил файл с сохраненной XML-строкой по электронной почте своему коллеге Петрову. Однако, к сожалению, файл повредился в процессе пересылки: ровно один символ в строке заменился на некоторый другой символ.\n",
    "\n",
    "Требуется написать программу, которая по строке, которую получил Петров, восстановит исходную XML-строку, которую отправлял Иванов.\n",
    "\n",
    "Формат ввода\n",
    "Входной файл содержит одну строку, которая заменой ровно одного символа может быть превращена в корректную XML-строку. Длина строки лежит в пределах от 7 до 1000, включительно. Строка содержит только строчные буквы латинского алфавита и символы «<» (ASCII код 60), «>»(ASCII код 62) и «/»(ASCII код 47). Строка во входном файле заканчивается переводом строки.\n",
    "\n",
    "Формат вывода\n",
    "Выходной файл должен содержать корректную XML-строку, которая может быть получена из строки во входном файле заменой ровно одного символа на другой. Если вариантов ответа несколько, можно вывести любой."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "87a4327c",
   "metadata": {},
   "outputs": [],
   "source": [
    "#wa - 17 тест\n",
    "\n",
    "from collections import deque\n",
    "\n",
    "string = input()\n",
    "stack = deque([])\n",
    "marker = None\n",
    "k = 0\n",
    "if '><>' not in string and '><<' not in string and '<><' not in string and '>><' not in string and '<>' not in string:\n",
    "    for i in range(1, len(string) - 1):\n",
    "\n",
    "        if string[0] != '<':\n",
    "            string = f'<{string[1:]}'\n",
    "        if string[-1] != '>':\n",
    "            string = f'{string[:-1]}>'\n",
    "\n",
    "        if string[i] == '>' and string[i + 1] != '<':\n",
    "            string = f'{string[:i + 1]}<{string[i + 2:]}'\n",
    "\n",
    "        if string[i] != '>' and string[i + 1] == '<':\n",
    "            string = f'{string[:i]}>{string[i + 1:]}'\n",
    "\n",
    "    # if string[i] == '<' and string[i-1] == '>': #здесь и ниже для примера <a><>a>\n",
    "    #     marker = True\n",
    "    # elif :\n",
    "    #     marker = False\n",
    "    k += 1\n",
    "\n",
    "\n",
    "def corrector(a, b):\n",
    "    if '/' not in a and '<' not in a and '>' not in a:\n",
    "        b = f'/{a}'\n",
    "    elif b[0] == '/':\n",
    "        a = b[1:]\n",
    "    return a, b\n",
    "def check(list):\n",
    "    global l\n",
    "    k = 0\n",
    "    stack = []\n",
    "    for i in list:\n",
    "        if i[0] != '/':\n",
    "            stack.append(i)\n",
    "        else:\n",
    "            if len(stack) != 0:\n",
    "                if i[1:] == stack[-1]:\n",
    "                    stack.pop()\n",
    "                else:\n",
    "                    return False\n",
    "            else:\n",
    "                return False\n",
    "    if len(stack) == 0:\n",
    "        for i in range(len(l)):\n",
    "            if l[i] != list[i]:\n",
    "                for j in range(len(l[i])):\n",
    "                    if l[i][j] != list[i][j]:\n",
    "                        k += 1\n",
    "        if k == 1:\n",
    "            return True\n",
    "        else:\n",
    "            return False\n",
    "    else:\n",
    "        return False\n",
    "\n",
    "marker = None\n",
    "l = string[1:-1].split('><')\n",
    "p = l.copy()\n",
    "ans, ans_list = '<', []\n",
    "for i in range(len(l)):\n",
    "    if marker: break\n",
    "    else:\n",
    "        for j in range(i+1, len(l)):\n",
    "            if len(l[i]) + 1 == len(l[j]):\n",
    "\n",
    "                p[i], p[j] = corrector(l[i], l[j])\n",
    "\n",
    "                if check(p):\n",
    "                    ans_list = p\n",
    "                    marker = True\n",
    "                    break\n",
    "                else:\n",
    "                    p = l.copy()\n",
    "\n",
    "if ans_list != []:\n",
    "    for i in range(len(ans_list)):\n",
    "        ans += ans_list[i]\n",
    "        if i != len(ans_list) - 1:\n",
    "            ans += '><'\n",
    "    ans += '>'\n",
    "    print(ans)\n",
    "else:\n",
    "    print(string)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b8990d29",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
