{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "3365e61e",
   "metadata": {},
   "source": [
    "Вера очень много работала в этом году, подавая своим коллегам пример настоящего труженика. На восьмое марта за прекрасное исполнение служебных обязанностей Вера получила подарок — долгожданный отпуск в Теплой Стране! Тяжелые трудовые будни закончились, и Вера уже нежится на пляже на берегу Теплого Моря.\n",
    "\n",
    "Любимое хобби Веры — пляжный волейбол, и как же Вера ждала момента, когда она сможет испытать невероятный азарт этой игры! Вера уже познакомилась с несколькими симпатичными волейболистами, но она пока не решила, какая же команда достойна иметь в своем составе такого замечательного игрока.\n",
    "\n",
    "Каждый из N капитанов команд мечтает заполучить Веру в состав своей команды, поэтому они хотят максимально проявить себя. Так как поиграть хотят все, они решили действовать следующим образом: все N команд выстроились в очередь. Первый матч играется между двумя командами, которые стоят в очереди раньше остальных. Победитель игры остается на площадке, а проигравший отправляется в конец очереди. В каждом из следующих матчей победитель предыдущего играет с первой командой из очереди, а про- игравший в очередной встрече опять становится в конец очереди. Каждая команда имеет некоторую силу, причем для простоты будем предполагать, что силы всех команд различны, а победителем в матче является команда, сила которой больше. Матчей может быть как угодно много.\n",
    "\n",
    "Вера решила для себя, что она будет действовать по самому справедливому принципу «считалочки»: она будет играть с одной из двух команд, играющих матч с соответствующем считалке номером K. Но затем Вера поняла, что уже выбрала себе команду, в которой хотела бы играть, причем ориентируясь не только на ее силу. Ей известны Q считалок, соответствующих различным значениям K. Для каждого из этих чисел Ki необходимо узнать, а кто же именно будет сражаться за столь ценный приз, то есть какие две команды будут играть в матче с номером Ki.\n",
    "\n",
    "Формат ввода\n",
    "Первая строка входных данных содержит единственное целое число N — количество команд (2 ≤ N ≤ 100 000). Вторая строка содержит N различных чисел от 1 до N — силы команд: первое число — сила команды, стоящей в начале очереди, второе — сила следующей по очереди команды, ..., последнее — сила команды, стоящей в конце очереди.\n",
    "\n",
    "Третья строка содержит единственное целое число Q (1 ≤ Q ≤ 100 000) — количество известных Вере считалок. Каждая из следующих Q строк содержит число Ki (1 ≤ Ki ≤ 1018) — номер очередного интересующего Веру матча. Обратите внимание, Ki может быть больше N.\n",
    "\n",
    "Формат вывода\n",
    "Выведите Q строк: для каждого интересующего Веру числа Ki два числа в любом порядке — силы команд, сыграющих на Ki-м шаге. Первая строка должна содержать ответ на первый запрос, вторая — на второй и так далее."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5e7edf4a",
   "metadata": {},
   "outputs": [],
   "source": [
    "from collections import deque\n",
    "\n",
    "n = int(input())\n",
    "d = deque(map(int, input().split()))\n",
    "k = []\n",
    "for i in range(int(input())):\n",
    "    k.append(int(input()))\n",
    "\n",
    "match_number = 0\n",
    "matchs = []\n",
    "max_power = max(d)\n",
    "\n",
    "while True:\n",
    "    a, b = d.popleft(), d.popleft()\n",
    "    if a >= b:\n",
    "        d.appendleft(a)\n",
    "        d.append(b)\n",
    "        match_number += 1\n",
    "    else:\n",
    "        d.appendleft(b)\n",
    "        d.append(a)\n",
    "        match_number += 1\n",
    "\n",
    "    if d[0] == max_power:\n",
    "        d.popleft()\n",
    "        break\n",
    "\n",
    "    matchs.append([a, b])\n",
    "\n",
    "for i in k:\n",
    "    if i < match_number:\n",
    "        print(*matchs[i - 1])\n",
    "    else:\n",
    "        print(max_power, d[(i - match_number) % (n - 1) - 1])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4c470f58",
   "metadata": {},
   "outputs": [],
   "source": [
    "#когда команда с наибольшей степенью оказывается слева (n-1 в худшем случае), то положения команд начинают повторяться\n",
    "# каждые n - 1 шагов "
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
